docs/posts/2025-10-20-political-parties-church.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Oct 20, 2025 05:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Political Parties and the Church</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Political Parties and the Church
<br />
<span class="subtitle">Oct 20, 2025 05:34</span>
</h1>
<p>
In his Baptist News Global piece, &ldquo;<a href="https://baptistnews.com/article/heres-what-the-churches-of-christ-and-maga-have-in-common/">Here’s what the Churches of Christ and MAGA have in common</a>,&rdquo; Richard T. Hughes writes:
</p>

<blockquote>
<p>
The problem would be just as acute had Churches of Christ been captured by Democratic as opposed to Republican interests since both parties — indeed, all political parties — are wed to the right-side-up interests of power, wealth and control. Disciples of Jesus, however, pledge allegiance to the upside-down kingdom of God where they serve the least of these, place the interests of others above their own, and stand in solidarity with oppressed and marginalized people.
</p>
</blockquote>

<p>
Hughes is speaking about the Churches of Christ, but it is true of all Christian denominations. It is tempting to align ourselves with a political party in order to use that party as a tool of the gospel, but the inevitable consequence is that the resulting perversion of the gospel instead becomes a tool that the party uses to maintain power.
</p>

<p>
We have but one Lord and one King, Jesus Christ.
</p>

<div class="tagline" id="org7f63d0e">
<p>
Tagged:  <a href="../tags/religion.html">Religion</a> <a href="../tags/politics.html">Politics</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Oct 20, 2025 05:47.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
